#Задание №1 
#Найдите сумму цифр трехзначного числа.
# Используйте f-строки чтобы оформить красивый вывод
# Примеры/Тесты:
# 123 >> > Сумма чисел числа 123 равна 6
# 100 >> > Сумма чисел числа 100 равна 1
# (*) Усложнение. Решите для числа произвольной разрядности: произвольное количество цифр в числе.

# (**) Усложнение. Для числа произвольной разрядности добавить в вывод строку с числами, например так:

# 13579 >> > Сумма чисел числа 13579 равна 25(1 + 3 + 5 + 7 + 9)

user_number = input("Введите 3-х значное число: ")
number1 = user_number[:1]
number2 = user_number[1:2]
number3 = user_number[2:3]
num1 = int(number1)
num2 = int(number2)
num3 = int(number3)
sum_num = num1 + num2 + num3
print(f'Сумма чисел введенного числа: {sum_num}')

# --------------------------------------
user_number1 = input("Введите число: ")
summa = sum(map(int, list(str(user_number1))))
print(f'Сумма чисел числа {user_number1} равна {summa}', end='\n')

print(*str(user_number1), sep=' + ')
