# На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. Выведите минимальное количество монет, которые нужно перевернуть. Количество монет и их положение(0 или 1) пользователь вводит с клавиатуры.
# Примеры/Тесты:
# Введите кол-во монет >? 5
# Положение монеты 0: 0 или 1 >? 1
# ...
# 1 0 1 1 0
# Кол-во монет, чтобы перевернуть: 2


coin = int(input("Введите общее кол-во монет: "))
position0 = 0
position1 = 0
for i in range(coin):
    if coin == 0 or coin == 1:
        print("Такое количестов монет не сравнивается, попобуйте ещё раз ")
        break
    position = int(
        input(f"Введите положение монеты под номером {i}: 0 или 1: "))
    if position != 0 and position != 1:
        print(" Зависла в воздухе, попробуйте ещё раз")
        break
    elif position == 0:
        position0 += 1
    else:
        position1 += 1
else:
    print(
        f" Минимальное кол-во монет, которые нужно перевернуть: {min(position0, position1)} ")
