# Требуется вывести все целые степени двойки (т.е. числа вида 2^k), не превосходящие числа N.
# Примеры/Тесты:
# 10 ->
# 1                % 2 == 0 все числа кратные 2 (%2 ==0)
# 2
# 4
# 2
# (*) Усложнение. Вывод оформить в одну строку: числа выводить через запятую. Для этого воспользоваться параметрами функции print

# Примеры/Тесты:
# 10     -> 1,2,4,8,
# 10000  -> 1,2,4,8,16,32,64,128,256,512,1024,2048,4096,8192,

# **********************************************
#  все числа кратные 2 (%2 == 0)


number = int(input("Ведите число: "))
for i in range(number):
    deg = 2**i
    if deg > number:
        break
    # print(deg)
    print(deg, end=" , ")
