# Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и
# получали билет с номером.Счастливым билетом называют такой билет с шестизначным номером,
# где сумма первых трех цифр равна сумме последних трех.
# Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6.
# Вам требуется написать программу, которая проверяет счастливость билета.
# Примеры/Тесты:
# 385916 >>> yes
# 123456 >>> no
# (*) Усложнение. Вывод результат на экран сделайте одной строкой(только один print),
# для этого используйте тернарный оператор

num_tik = input("Введите 6-ти значный номер билета: ")
num1 = num_tik[:1]
num2 = num_tik[1:2]
num3 = num_tik[2:3]
num1_1 = int(num1)
num2_2 = int(num2)
num3_3 = int(num3)
sum_right = num1_1 + num2_2 + num3_3

num4 = num_tik[3:4]
num5 = num_tik[4:5]
num6 = num_tik[5:]
num4_4 = int(num4)
num5_5 = int(num5)
num6_6 = int(num6)
sum_left = num4_4 + num5_5 + num6_6
print(f'Сумма цифр в правой стороне равна {sum_right}, а в левой {sum_left}')
if sum_left != sum_right:
    num_tik = False
else:
    num_tik = True
print(num_tik)




