
# Определить индексы элементов массива (списка), значения которых принадлежат заданному диапазону
# (т.е. не меньше заданного минимума и не больше заданного максимума)

# Напишите функцию
#     Аргументы: список чисел и границы диапазона
#     Возвращает: список индексов элементов (смотри условие)

# Примеры/Тесты:
#     lst1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
#     <function_name>(lst1, 2, 10) -> [1, 3, 7, 9, 10, 13, 14, 19]
#     <function_name>(lst1, 2, 9) -> [1, 3, 7, 10, 13, 19]
#     <function_name>(lst1, 0, 6) -> [2, 3, 6, 7, 10, 11, 16]



# Усложнение
# - Для формирования списка внутри функции используйте Comprehension
# Усложнение
# - Функция возвращает список кортежей вида: индекс, значение
# Примеры/Тесты:
#     lst1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]
#     <function_name>(lst1, 2, 10) -> [(1, 9), (3, 3), (7, 4), (9, 10), (10, 2), (13, 8), (14, 10), (19, 7)]



def user_ind(lst, min, max):
    # for idx, el in enumerate(lst):
        #  if min <= el <= max:
        lst_u = [el for ind, el in enumerate(lst) if min <= el <= max]
        lst_t = [idx for idx, el in enumerate(lst) if min <= el <= max]
        return (list(zip(lst_t, lst_u)))                                  #выводим список из кортежей

lst1 = [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]

lst_a = user_ind(lst1, 2, 10)
lst_b = user_ind(lst1, 2, 9)
lst_c = user_ind(lst1, 0, 6)

# print(dict(lst_a))                          # попробовала как будетвыглядеть виде словаря
# print((lst_a, lst_b, lst_c))                # tесли выводить все сразу, получается нечитабельно
print(user_ind(lst1, 2, 10))
print(user_ind(lst1, 2, 9))
print(user_ind(lst1, 0, 6))